read_verilog cpu.v alu.v dummydecoder.v regfile.v 
synth_xilinx -top cpu
write_verilog cpu_synth.v

